#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/swdemo/kubernetes-ops-staging-helm-cert-manager/runs/run-fF3vfK2pzqHDBZzN

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.eks: Reading...
data.terraform_remote_state.route53_hosted_zone: Reading...
data.template_file.helm_values: Reading...
data.template_file.helm_values: Read complete after 0s [id=a2422577f6ffbb3fbcd4a983174058f75b3dd3218ff8c71095c4522e7c760122]
data.aws_eks_cluster_auth.main: Reading...
data.aws_eks_cluster_auth.main: Read complete after 0s [id=staging]
data.terraform_remote_state.eks: Read complete after 0s
data.terraform_remote_state.route53_hosted_zone: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.ClusterIssuer will be created
  + resource "kubectl_manifest" "ClusterIssuer" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt
              namespace: cert-manager
            spec:
              acme:
                email: nareshraj423@yahoo.com
                privateKeySecretRef:
                  name: letsencrypt
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - http01:
                    ingress:
                      class: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.cert-manager.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                installCRDs: true
                extraArgs:
                  # https://github.com/jetstack/cert-manager/issues/1933
                  - --dns01-recursive-nameservers=8.8.8.8:53
                  - --dns01-recursive-nameservers-only
            EOT,
        ]
      + verify                     = false
      + version                    = "v1.3.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```


</details>

*Pusher: @RajAlexander, Action: `pull_request`*